Semester-7/Технология разработки прикладных решений 1С/lab8/src/DataProcessors/СервисныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>СервисныеОперации</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab8/src/Documents/ПриходТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПриходТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветТовара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦветаТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаТовара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab8/src/Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦветТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab8/src/DataProcessors/СервисныеОперации/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработка «Сервисные операции».
//
// Команды соответствуют разделам части 2 учебного пособия Семёнова,
// доработки — заданиям 3–9 курса. Имена серверных процедур совпадают
// с теми, что фигурируют в формулировках заданий.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедуры

&НаКлиенте
Функция КатегорияУказана()

	Если НЕ ЗначениеЗаполнено(КатегорияТоваров) Тогда
		Сообщить("Укажите категорию товаров.");
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область ЗаменаЦветаИСтраны

// Задание 3. Цвет заменяется только у товаров выбранной категории.
// В поле выбора категории разрешён выбор только групп, элемент указать нельзя.
&НаСервереБезКонтекста
Процедура ЗаменаЦветаНаСервере(Категория)

	ВыборкаТоваров = Справочники.Товары.Выбрать(Категория);
	Заменено = 0;

	Пока ВыборкаТоваров.Следующий() Цикл
		Если ВыборкаТоваров.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(ВыборкаТоваров.ЦветТовара) = "Зеленый" Тогда
			ТекущийТовар = ВыборкаТоваров.Ссылка.ПолучитьОбъект();
			ТекущийТовар.ЦветТовара = Справочники.ЦветаТоваров.НайтиПоКоду("Красный");
			ТекущийТовар.Записать();
			Заменено = Заменено + 1;
			Сообщить("Для товара " + ТекущийТовар.Наименование + " заменен зеленый цвет на красный.");
		КонецЕсли;
	КонецЦикла;

	Если Заменено = 0 Тогда
		Сообщить("В категории " + Категория + " товаров зелёного цвета не найдено.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаЦвета(Команда)

	Если КатегорияУказана() Тогда
		ЗаменаЦветаНаСервере(КатегорияТоваров);
	КонецЕсли;

КонецПроцедуры

// Задание 3. Страна заменяется только у товаров выбранной категории.
&НаСервереБезКонтекста
Процедура ЗаменаСтраныНаСервере(Категория)

	ВыборкаТоваров = Справочники.Товары.Выбрать(Категория);
	Заменено = 0;

	Пока ВыборкаТоваров.Следующий() Цикл
		Если ВыборкаТоваров.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(ВыборкаТоваров.СтранаТовара) = "Китай" Тогда
			ТекущийТовар = ВыборкаТоваров.Ссылка.ПолучитьОбъект();
			ТекущийТовар.СтранаТовара = Справочники.СтраныТоваров.НайтиПоКоду("Россия");
			ТекущийТовар.Записать();
			Заменено = Заменено + 1;
			Сообщить("Для товара " + ТекущийТовар.Наименование + " заменена страна Китай на Россию.");
		КонецЕсли;
	КонецЦикла;

	Если Заменено = 0 Тогда
		Сообщить("В категории " + Категория + " товаров из Китая не найдено.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаСтраны(Команда)

	Если КатегорияУказана() Тогда
		ЗаменаСтраныНаСервере(КатегорияТоваров);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СозданиеГруппы

// Задание 4, пункт 1. Перед созданием проверяем, нет ли уже группы с таким именем.
&НаСервереБезКонтекста
Процедура СоздатьГруппуНаСервере(ИмяГруппы)

	СуществующаяГруппа = Справочники.Товары.НайтиПоНаименованию(СокрЛП(ИмяГруппы), Истина);

	Если НЕ СуществующаяГруппа.Пустая() И СуществующаяГруппа.ЭтоГруппа Тогда
		Сообщить("Группа «" + СокрЛП(ИмяГруппы) + "» уже существует, новая не создана.");
		Возврат;
	КонецЕсли;

	НоваяГруппаТоваров = Справочники.Товары.СоздатьГруппу();
	НоваяГруппаТоваров.Наименование = СокрЛП(ИмяГруппы);
	НоваяГруппаТоваров.Записать();
	Сообщить("Создана группа «" + СокрЛП(ИмяГруппы) + "».");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)

	Если НЕ ЗначениеЗаполнено(НоваяГруппа) Тогда
		Сообщить("Укажите имя новой группы.");
		Возврат;
	КонецЕсли;
	СоздатьГруппуНаСервере(НоваяГруппа);

КонецПроцедуры

#КонецОбласти

#Область УдалениеТовара

// Задание 4, пункт 2. Перед удалением показываем, в каких документах есть ссылки на товар.
&НаСервереБезКонтекста
Процедура УдалитьТоварНаСервере(Товар)

	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Товар);
	НайденныеСсылки = НайтиПоСсылкам(МассивСсылок);

	Если НайденныеСсылки.Количество() > 0 Тогда
		Сообщить("На товар «" + Товар + "» есть ссылки в следующих объектах:");
		Для Каждого СтрокаСсылки Из НайденныеСсылки Цикл
			Сообщить("    " + СтрокаСсылки.Метаданные + ": " + СтрокаСсылки.Данные);
		КонецЦикла;
		Сообщить("Товар помечен на удаление, но не удалён физически.");
		ОбъектТовара = Товар.ПолучитьОбъект();
		ОбъектТовара.УстановитьПометкуУдаления(Истина);
		Возврат;
	КонецЕсли;

	ОбъектТовара = Товар.ПолучитьОбъект();
	ОбъектТовара.Удалить();
	Сообщить("Товар «" + Товар + "» удалён: ссылок на него не найдено.");

КонецПроцедуры

&НаКлиенте
Процедура УдалитьТовар(Команда)

	Если НЕ ЗначениеЗаполнено(ТоварДляУдаления) Тогда
		Сообщить("Укажите товар.");
		Возврат;
	КонецЕсли;
	УдалитьТоварНаСервере(ТоварДляУдаления);
	ТоварДляУдаления = Неопределено;

КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаВТекстовыйФайл

// Задание 4, пункт 3. В выгрузку добавлены цвет и страна товара.
// Формат строки: Код;Наименование;Цвет;Страна
&НаСервереБезКонтекста
Процедура ВыгрузитьТекстНаСервере(Категория, ПутьФайла)

	Текст = Новый ТекстовыйДокумент;
	ВыборкаТоваров = Справочники.Товары.Выбрать(Категория);

	Пока ВыборкаТоваров.Следующий() Цикл
		Если ВыборкаТоваров.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Текст.ДобавитьСтроку(СокрЛП(ВыборкаТоваров.Код) + ";"
			+ СокрЛП(ВыборкаТоваров.Наименование) + ";"
			+ СокрЛП(ВыборкаТоваров.ЦветТовара) + ";"
			+ СокрЛП(ВыборкаТоваров.СтранаТовара));
	КонецЦикла;

	Текст.Записать(ПутьФайла, КодировкаТекста.UTF8);
	Сообщить("Выгружено строк: " + Текст.КоличествоСтрок() + ". Файл: " + ПутьФайла);

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТекст(Команда)

	Если НЕ КатегорияУказана() Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Укажите путь к текстовому файлу.");
		Возврат;
	КонецЕсли;
	ВыгрузитьТекстНаСервере(КатегорияТоваров, ПутьКФайлу);

КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаИзТекстовогоФайла

// Задание 5. Загружаем цвет и страну; одинаковые товары повторно не создаём.
&НаСервереБезКонтекста
Процедура ЗагрузитьТекстНаСервере(Категория, ПутьФайла)

	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ПутьФайла, КодировкаТекста.UTF8);

	Загружено = 0;
	Пропущено = 0;

	Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл

		ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерСтроки));
		Если ПустаяСтрока(ТекущаяСтрока) Тогда
			Продолжить;
		КонецЕсли;

		Части = СтрРазделить(ТекущаяСтрока, ";", Истина);
		Если Части.Количество() < 2 Тогда
			Сообщить("Строка " + НомерСтроки + " пропущена: не разобрана.");
			Продолжить;
		КонецЕсли;

		НаимТовара  = СокрЛП(Части[1]);
		ИмяЦвета    = ?(Части.Количество() > 2, СокрЛП(Части[2]), "");
		ИмяСтраны   = ?(Части.Количество() > 3, СокрЛП(Части[3]), "");

		// Задание 5: одинаковые товары не загружаем.
		Если ТоварУжеЕсть(Категория, НаимТовара) Тогда
			Сообщить("Такой товар уже есть: " + НаимТовара);
			Пропущено = Пропущено + 1;
			Продолжить;
		КонецЕсли;

		НовыйТовар = Справочники.Товары.СоздатьЭлемент();
		НовыйТовар.Наименование = НаимТовара;
		НовыйТовар.Родитель = Категория;

		Если НЕ ПустаяСтрока(ИмяЦвета) Тогда
			НовыйТовар.ЦветТовара = ПолучитьИлиСоздатьЦвет(ИмяЦвета);
		КонецЕсли;
		Если НЕ ПустаяСтрока(ИмяСтраны) Тогда
			НовыйТовар.СтранаТовара = ПолучитьИлиСоздатьСтрану(ИмяСтраны);
		КонецЕсли;

		НовыйТовар.Записать();
		Загружено = Загружено + 1;
		Сообщить("Товар " + НаимТовара + " загружен в категорию " + Категория);

	КонецЦикла;

	Сообщить("Загружено: " + Загружено + ", пропущено дублей: " + Пропущено);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТоварУжеЕсть(Категория, НаимТовара)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Товары.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Товары КАК Товары
		|ГДЕ
		|	Товары.Родитель = &Категория
		|	И НЕ Товары.ЭтоГруппа
		|	И Товары.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("Наименование", НаимТовара);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИлиСоздатьЦвет(ИмяЦвета)

	Цвет = Справочники.ЦветаТоваров.НайтиПоНаименованию(ИмяЦвета, Истина);
	Если НЕ Цвет.Пустая() Тогда
		Возврат Цвет;
	КонецЕсли;
	НовыйЦвет = Справочники.ЦветаТоваров.СоздатьЭлемент();
	НовыйЦвет.Наименование = ИмяЦвета;
	НовыйЦвет.Код = ИмяЦвета;
	НовыйЦвет.Записать();
	Возврат НовыйЦвет.Ссылка;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИлиСоздатьСтрану(ИмяСтраны)

	Страна = Справочники.СтраныТоваров.НайтиПоНаименованию(ИмяСтраны, Истина);
	Если НЕ Страна.Пустая() Тогда
		Возврат Страна;
	КонецЕсли;
	НоваяСтрана = Справочники.СтраныТоваров.СоздатьЭлемент();
	НоваяСтрана.Наименование = ИмяСтраны;
	НоваяСтрана.Код = ИмяСтраны;
	НоваяСтрана.Записать();
	Возврат НоваяСтрана.Ссылка;

КонецФункции

&НаКлиенте
Процедура ЗагрузитьТекст(Команда)

	Если НЕ КатегорияУказана() Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Укажите путь к текстовому файлу.");
		Возврат;
	КонецЕсли;
	ЗагрузитьТекстНаСервере(КатегорияТоваров, ПутьКФайлу);

КонецПроцедуры

#КонецОбласти

#Область ОбменДокументами

// Задание 6, пункт 1. Выгрузка данных документа в текстовый файл.
// Формат: шапка «H;<склад>», затем строки «R;<товар>;<цвет>;<страна>;<количество>».
&НаСервереБезКонтекста
Процедура ВыгрузитьДокументНаСервере(ДокументСсылка, ПутьФайла)

	Данные = ДокументСсылка.ПолучитьОбъект();

	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку("H;" + СокрЛП(Данные.Склад));

	Для Каждого Строка Из Данные.СписокТоваров Цикл
		Текст.ДобавитьСтроку("R;" + СокрЛП(Строка.Товар) + ";"
			+ СокрЛП(Строка.ЦветТовара) + ";"
			+ СокрЛП(Строка.СтранаТовара) + ";"
			+ Формат(Строка.Количество, "ЧГ=0"));
	КонецЦикла;

	Текст.Записать(ПутьФайла, КодировкаТекста.UTF8);
	Сообщить("Документ " + ДокументСсылка + " выгружен в " + ПутьФайла);

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокумент(Команда)

	Если НЕ ЗначениеЗаполнено(ДокументПрихода) Тогда
		Сообщить("Укажите документ прихода.");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуДокумента) Тогда
		Сообщить("Укажите путь к файлу документа.");
		Возврат;
	КонецЕсли;
	ВыгрузитьДокументНаСервере(ДокументПрихода, ПутьКФайлуДокумента);

КонецПроцедуры

// Задание 6, пункт 2. Загрузка данных из текстового файла в новый документ.
&НаСервереБезКонтекста
Функция ЗагрузитьДокументНаСервере(ПутьФайла)

	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ПутьФайла, КодировкаТекста.UTF8);

	НовыйДокумент = Документы.ПриходТоваров.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();

	Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл

		ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерСтроки));
		Если ПустаяСтрока(ТекущаяСтрока) Тогда
			Продолжить;
		КонецЕсли;

		Части = СтрРазделить(ТекущаяСтрока, ";", Истина);

		Если Части[0] = "H" Тогда
			НовыйДокумент.Склад = Справочники.Склады.НайтиПоНаименованию(СокрЛП(Части[1]), Истина);
		ИначеЕсли Части[0] = "R" Тогда
			НоваяСтрока = НовыйДокумент.СписокТоваров.Добавить();
			НоваяСтрока.Товар = Справочники.Товары.НайтиПоНаименованию(СокрЛП(Части[1]), Истина);
			НоваяСтрока.ЦветТовара = Справочники.ЦветаТоваров.НайтиПоНаименованию(СокрЛП(Части[2]), Истина);
			НоваяСтрока.СтранаТовара = Справочники.СтраныТоваров.НайтиПоНаименованию(СокрЛП(Части[3]), Истина);
			НоваяСтрока.Количество = Число(СокрЛП(Части[4]));
		КонецЕсли;

	КонецЦикла;

	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	Сообщить("Создан документ " + НовыйДокумент.Ссылка + " (строк: "
		+ НовыйДокумент.СписокТоваров.Количество() + ")");

	Возврат НовыйДокумент.Ссылка;

КонецФункции

&НаКлиенте
Процедура ЗагрузитьДокумент(Команда)

	Если НЕ ЗначениеЗаполнено(ПутьКФайлуДокумента) Тогда
		Сообщить("Укажите путь к файлу документа.");
		Возврат;
	КонецЕсли;
	ДокументПрихода = ЗагрузитьДокументНаСервере(ПутьКФайлуДокумента);

КонецПроцедуры

#КонецОбласти

#Область КопированиеДокумента

// Задание 7. Аналог команды «НовыйДокумент»: копируем документ и спрашиваем,
// нужно ли его проводить.
&НаСервереБезКонтекста
Функция КопироватьДокументНаСервере(ДокументСсылка, Проводить)

	Копия = ДокументСсылка.Скопировать();
	Копия.Дата = ТекущаяДата();

	Если Проводить Тогда
		Копия.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Создана копия " + Копия.Ссылка + ", документ проведён.");
	Иначе
		Копия.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Создана копия " + Копия.Ссылка + " без проведения.");
	КонецЕсли;

	Возврат Копия.Ссылка;

КонецФункции

&НаКлиенте
Процедура КопироватьДокумент(Команда)

	Если НЕ ЗначениеЗаполнено(ДокументПрихода) Тогда
		Сообщить("Укажите документ прихода.");
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("КопироватьДокументЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Провести созданный документ?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура КопироватьДокументЗавершение(Результат, ДополнительныеПараметры) Экспорт

	КопироватьДокументНаСервере(ДокументПрихода, Результат = КодВозвратаДиалога.Да);

КонецПроцедуры

#КонецОбласти
